docs/posts/2015-02-11-prayer-for-a-life-that-affirms.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 27, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for a Life that Affirms</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for a Life that Affirms</h1>
<p class="subtitle" role="doc-subtitle">Feb 11, 2015</p>
</header><p>
Casie Trotter sent me a link to a wonderful passage from Nietzsche&rsquo;s 1882 book, <i>The Gay Science</i>. This is aphorism 276, his resolution for that year:
</p>

<blockquote>
<p>
I want to learn more and more how to see what is necessary in things as what is beautiful in them — thus I will be one of those who make things beautiful&#x2026; I do not want to wage war against ugliness. I do not want to accuse; I do not even want to accuse the accusers&#x2026; And all in all and on the whole: some day I want only to be a Yes-sayer!
</p>
</blockquote>

<p>
I&rsquo;m not sure what Nietzsche would think of his work prompting this week&rsquo;s prayer, but here it is anyway:
</p>

<p>
God of beauty and wonder,
</p>

<p>
Let me be known<br>
not for what I found ugly,<br>
but for what I found beautiful.
</p>

<p>
Not for what was harmed,<br>
but for what was healed.
</p>

<p>
Not for what I tore down,<br>
but for what I built up.
</p>

<p>
Not for what I despised,<br>
but for all that I loved.
</p>

<p>
In the name of the one<br>
who sees the beauty in us all,
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org372ac11">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 27, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
